-----技能释放-----------------------------------------
--技能Config/技能信息配置
--[技能ID] = {初始CD、cd、限定ODStateType、是否OD状态切换重置CD，限定阶段、重置CD阶段、血量条件，距离条件、角度条件、是否角度修正、角度修正概率}
--初始CD，一开始就赋值的CD
--cd：进入CD时的CD，技能表里已有
--限定ODStateType：只允许在哪些ODState下释放。
--是否OD状态切换重置CD:OD的状态切换是否重置CD，默认不重置
--限定阶段：限定释放阶段，数组来的，默认不限制。
--血量要求{最小、最大}，百分比，0-100。
--距离条件:{最小，最大}，只填一个值时表示最大，例如{8}表示5m范围以内可释放，{4，8}表示4-8m范围内可释放
--角度条件{面向角度、偏移、旋转（绕Y轴平面顺时针）}
--是否角度修正：默认无，需要角度修正and有空间修正耐心and角度修正欲望通过and有合适的角度修正技能时，会释放角度修正技能。
--角度修正欲望：0-100，表示角度修正概率，技能其他条件都通过的情况下就差角度修正了，用来判断是否要修正的概率，50表示其他条件满足的情况下有50%概率会进行一次尝试角度修正，100表示每次其他条件满足的情况下都会尝试修正。
--（PS：1、触发修正逻辑在修正后会优先判断触发修正的技能条件2、尝试角度修正有可能会因为没有相应的修正技能或有障碍等原因修正失败。）
--优先级，技能筛选时按照优先级组进行权重筛选
--权重，涉及到随机权重时会使用到的参数。
local SkillConditions = {
    [0] ={ --SkillId
        InitCd = 0, --初始CD
        Cd = 0, --设置CD
        ODStateNeed ={},--限制OD状态释放
        IsODResetCd =false, --OD状态切换时重置CD
        PhaseNeed = {}, -- 阶段要求
        HpNeed = {}, --血量要求
        DistanceNeed = {}, --距离要求
        SpaceNeed = {}, --空间角度条件
        HaveTurnFix = false, --转向修正
        TurnProbability = 0, -- 转向概率
    },
    [805201] = {--格挡
        InitCd = 30,
        Cd = 10,
        DistanceNeed = {2}, --距离要求
        SpaceNeed={90,0,0}--面前90度
    },
    [805202] = {--反身拳
        InitCd = 15,
        Cd = 12,
        DistanceNeed = {8}, 
    },
    [805203] = {--上勾拳
        InitCd = 8,
        Cd=8,
        DistanceNeed = {5},
    },
    [805204] = {--欧拉拳
        InitCd = 20,
        Cd =20,
        DistanceNeed = {8}, --距离要求
    },
    [805205] = {--格挡反击
        Cd=15,
    },
    [805206] = {--流星冲锋坠
    },
    [805207] = {--交叉射击
        InitCd = 8,
        Cd=8,
        DistanceNeed = {10}, --距离要求
    },
    [805208] = {--推进拳
        InitCd = 8,
        Cd = 10,
        DistanceNeed = {6,20}, --6-15m放推进拳
    },
    [805209] = {--下段斩
        Cd=5,
    },
    [805210] = {--一阶段前推
    },
    [805211] = {--一阶段后推
    },
    [805212] = {--一阶段左推
    },
    [805213] = {--一阶段右推
    },
    [805214] = {--二阶段格挡反击
    },
    [805215] = {--拼刀受击击飞大
    },
    [805216] = {--二阶段地面蓄力炮
        Cd=5,
    },
    [805217] = {--二阶段空中左推1
    },
    [805218] = {--二阶段空中右推1
    },
    [805219] = {--二阶段空中左推2
    },
    [805220] = {--二阶段空中右推2
    },
    [805221] = {--移动射击向前
        DistanceNeed = {8,999}, --6m外释放
    },
    [805222] = {--光刃三连
        Cd=15,
    },
    [805223] = {--光刃上天
        Cd=10,
    },
    [805224] = {--光刃二连
        Cd=5,
    },
    [805225] = {--胸炮浮空版
    },
    [805226] = {--胸炮地面起跳版
        InitCd = 0,
        Cd=8,
    },
    [805227] = {--升龙腿
        Cd=30,
    },
    [805228] = {--空落锤
        Cd=10,
    },
    [805229] = {--重火锤
        Cd=10,
    },
    [805230] = {--后退斩
        Cd=5,
    },
    [805231] = {--响指波
    },
    [805232] = {--瑟提锤
        InitCd = 4,
        Cd = 4,
        DistanceNeed = {8,30},
    },
    [805233] = {--拼刀小受击
    },
    [805234] = {--二连拳
        Cd=8,
        DistanceNeed = {10},
    },
    [805235]={--进入OD技能
        
    }
}
return SkillConditions