XDlcQuestHotfixManager = {}

--- 线上在跑逻辑的hotfix的脚本ID集合，脚本ID需要保证不和之前的脚本ID冲突
--- 集合维护脚本ID和ObjectiveId的映射
--- 可以采取年份+月份+日期+小时++序号的方式来命名脚本ID
--- 例如：250425181代表25年年04月25日18时序号1的脚本ID
local HotfixObjectiveIds = {
    -- 2025.11.26 修复空花1.0线上卡交互任务无法推进问题 by ljb
    -- 以下四个ID不要再用了，线上已经用过了
    -- [251126181] = 300501121,
    -- [251126182] = 20010126,
    -- [251126183] = 20030132,
    -- [251126184] = 20030116,
    -- 2025.11.26 修复空花1.0线上卡交互任务无法推进问题 by ljb
    -- 因为任务修复脚本出了问题，导致上述修复过程中有报错
    -- 所以需要重新跑一遍修复脚本，因为服务端有记录id，不重复执行
    -- 所以使用新的id
    [251127181] = 300501121,
    [251127182] = 20010126,
    [251127183] = 20030132,
    [251127184] = 20030116,
}

function XDlcQuestHotfixManager.GetQuestObjectiveHotfixIds()
    return HotfixObjectiveIds
end
