-----技能释放-----------------------------------------
--技能Config/技能信息配置
--[技能ID] = {初始CD、cd、限定ODStateType、是否OD状态切换重置CD，限定阶段、重置CD阶段、血量条件，距离条件、角度条件、是否角度修正、角度修正概率}
--初始CD，一开始就赋值的CD
--cd：进入CD时的CD，技能表里已有
--限定ODStateType：只允许在哪些ODState下释放。
--是否OD状态切换重置CD:OD的状态切换是否重置CD，默认不重置
--限定阶段：限定释放阶段，数组来的，默认不限制。
--血量要求{最小、最大}，百分比，0-100。
--距离条件:{最小，最大}，只填一个值时表示最大，例如{8}表示5m范围以内可释放，{4，8}表示4-8m范围内可释放
--角度条件{面向角度、偏移、旋转（绕Y轴平面顺时针）}
--是否角度修正：默认无，需要角度修正and有空间修正耐心and角度修正欲望通过and有合适的角度修正技能时，会释放角度修正技能。
--角度修正欲望：0-100，表示角度修正概率，技能其他条件都通过的情况下就差角度修正了，用来判断是否要修正的概率，50表示其他条件满足的情况下有50%概率会进行一次尝试角度修正，100表示每次其他条件满足的情况下都会尝试修正。
--（PS：1、触发修正逻辑在修正后会优先判断触发修正的技能条件2、尝试角度修正有可能会因为没有相应的修正技能或有障碍等原因修正失败。）
--优先级，技能筛选时按照优先级组进行权重筛选
--权重，涉及到随机权重时会使用到的参数。
--[0] ={ --SkillId
--InitCd = 0, --初始CD
--Cd = 0, --设置CD
--IsNeedODState = false,--是否在OD状态下才可以释放
--IsLockInODState = false,--是否限制在OD状态下释放
--IsODResetCd =false, --OD状态切换时重置CD
--PhaseNeed = {}, -- 阶段要求
--HpNeed = {}, --血量要求
--DistanceNeed = {}, --距离要求
--SpaceNeed = {}, --空间角度条件
--HaveTurnFix = false, --转向修正
--TurnProbability = 0, -- 转向概率
--},
local SkillConditions = {
    [0] ={ --SkillId
        InitCd = 0,
        Cd = 0,
        PhaseNeed = {},
        HpNeed = {},
        DistanceNeed = {},
    },
    [805201] = {--格挡（逻辑释放）
        DistanceNeed = {3}, --距离要求
        SpaceNeed={90,0,0}--面前90度
    },
    [805202] = {--反身拳
        DistanceNeed = {8}, 
    },
    [805203] = {--上勾拳
        DistanceNeed = {6},
    },
    [805204] = {--欧拉拳
        DistanceNeed = {8}, --距离要求
    },
    [805205] = {--格挡反击（逻辑释放）
    },
    [805206] = {--流星冲锋坠（衔接）
        IsLockInODState = true,
    },
    [805207] = {--交叉射击
        DistanceNeed = {8}, --距离要求
        PhaseNeed = {2,3,4},
    },
    [805208] = {--推进拳
        DistanceNeed = {15},
        IsLockInODState = true,
    },
    [805209] = {--下段斩（空落锤衔接）
        PhaseNeed = {2,3,4},
    },
    [805210] = {--一阶段前推（衔接）
    },
    [805211] = {--一阶段后推（衔接）
    },
    [805212] = {--一阶段左推（衔接）
    },
    [805213] = {--一阶段右推（衔接）
    },
    [805214] = {--二阶段格挡反击（衔接）
    },
    [805215] = {--拼刀受击击飞大（衔接）
    },
    [805216] = {--二阶段地面蓄力炮
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805217] = {--二阶段空中左推1
    },
    [805218] = {--二阶段空中右推1
    },
    [805219] = {--二阶段空中左推2
    },
    [805220] = {--二阶段空中右推2
    },
    [805221] = {--移动射击向前
        DistanceNeed = {12,999}, --
    },
    [805222] = {--光刃三连(空落锤衔接)
        DistanceNeed = {20}, --
        IsLockInODState = true,
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805223] = {--光刃上天
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805224] = {--光刃二连
        DistanceNeed = {20}, --
        IsLockInODState = true,
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805225] = {--胸炮浮空版
    },
    [805226] = {--胸炮地面起跳版
        PhaseNeed = {2,3,4}, -- 阶段要求
        DistanceNeed ={20,999}
    },
    [805227] = {--升龙腿
        DistanceNeed ={10}
    },
    [805228] = {--空落锤(衔接)
    },
    [805229] = {--重火锤
        DistanceNeed ={10},
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805230] = {--后退斩
        DistanceNeed ={20,999},
        PhaseNeed = {5}, -- 阶段要求
    },
    [805231] = {--响指波
    },
    [805232] = {--瑟提锤
        DistanceNeed = {10,9999},
        IsLockInODState = true,
    },
    [805233] = {--拼刀小受击
    },
    [805234] = {--二连拳
        DistanceNeed = {8},
    },
    [805235]={--进入OD技能
    },
    [805236]={--进入OD技能
    },
    [805237]={--进入OD技能
    },
    [805238]={--进入OD技能
    },
    [805239]={--进入OD技能
    },
    [805240]={ --冲刺前蓄力
    },
    [805241]={ --冲刺过程慢
    },
    [805242]={ --冲刺过程快
    },
    [805243]={ --冲刺过程，一瞬前击
    },
    [805244]={ --受击：轻后
    },
    [805245]={ --受击：轻前
    },
    [805246]={ --受击：轻左
    },
    [805247]={ --受击：轻右
    },
    [805248]={ --OD连续推进拳
        IsNeedODState = true,
    },
    [805249]={ --OD瑟提锤
        IsNeedODState = true,
    },
    [805257]={ --浮空机制启动技能
        IsNeedODState = true,
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805258]={ --Dash机制启动技能
        IsNeedODState = true,
        PhaseNeed = {1,3}
    },
    [805276] ={--蓄力大不死斩
        IsNeedODState = true,
    },
    [805273] ={--OD：胸炮浮空版
    },
    [805274] ={--OD：胸炮地面起跳版
        PhaseNeed = {2,3,4}, -- 阶段要求
        DistanceNeed ={6,999}
    },
    [805275] ={--OD:蓄力不死斩启动技能
        PhaseNeed = {2,3,4}, -- 阶段要求
        IsNeedODState = true,
    },
    [805277] ={--OD：光刃二连
        DistanceNeed = {20},
        IsNeedODState = true,
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805278] ={--OD：光刃三连
        DistanceNeed = {20}, 
        IsNeedODState = true,
        PhaseNeed = {2,3,4}, -- 阶段要求
    },
    [805279] ={--OD:流星冲锋坠
        IsNeedODState = true,
    },
    --------------70AI的技能条件配置-------------------------
    [105215] ={ --70
        DistanceNeed = {9},
    },
    [105216] ={ --70
        DistanceNeed = {13},
    },
    [105217] ={ --70
        DistanceNeed = {13},
    },
    [105218] ={ --70
        DistanceNeed = {13},
    },

    --------------丽芙AI的技能条件配置-------------------------
    [105301] ={ --普攻
        DistanceNeed = {15},
    },
    [105302] ={ --普攻
        DistanceNeed = {15},
    },
    [105303] ={ --普攻
        DistanceNeed = {15},
    },
    [105304] ={ --普攻
        DistanceNeed = {15},
    },
    [105305] ={ --普攻
        DistanceNeed = {15},
    },
    [105306] ={ --普攻
        DistanceNeed = {15},
    },
}
return SkillConditions